Ran Plan for project: `s3-dev` dir: `infrastructure/s3` workspace: `dev`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_s3_bucket.this["bucket1"] will be created
+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "app-metal-corp-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CreationOrigin" = "terraform"
          + "Env"            = "dev"
          + "SubSystem"      = "Metal.corp"
          + "System"         = "S3"
          + "Team"           = "DevOps-CE"
        }
      + tags_all                    = {
          + "CreationOrigin" = "terraform"
          + "Env"            = "dev"
          + "SubSystem"      = "Metal.corp"
          + "System"         = "S3"
          + "Team"           = "DevOps-CE"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # aws_s3_bucket_public_access_block.this["bucket1"] will be created
+ resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.


time="2022-08-05T12:05:01Z" level=info msg="Detected Terraform plan binary file at /home/atlantis/.atlantis/repos/EzzioMoreira/terraform-atlantis/23/dev/infrastructure/s3/s3-dev-dev.tfplan"
time="2022-08-05T12:05:01Z" level=info msg="Starting: Running terraform show"
time="2022-08-05T12:05:04Z" level=info msg="Starting: Extracting only cost-related params from terraform"
time="2022-08-05T12:05:04Z" level=info msg="Starting: Retrieving cloud prices to calculate costs"

##### Infracost estimate #####

Monthly cost will increase by $0.00 (+0%%)

Previous monthly cost: $0.00
New monthly cost: $0.00

Infracost output:

    Project: github.com/EzzioMoreira/terraform-atlantis.git/infrastructure/s3/s3-dev-dev.tfplan
    
    + aws_s3_bucket.this["bucket1"]
      Monthly cost depends on usage
    
        + Standard
        
            + Storage
              Monthly cost depends on usage
                +$0.023 per GB
        
            + PUT, COPY, POST, LIST requests
              Monthly cost depends on usage
                +$0.005 per 1k requests
        
            + GET, SELECT, and all other requests
              Monthly cost depends on usage
                +$0.0004 per 1k requests
        
            + Select data scanned
              Monthly cost depends on usage
                +$0.002 per GB
        
            + Select data returned
              Monthly cost depends on usage
                +$0.0007 per GB
    
    Monthly cost change for github.com/EzzioMoreira/terraform-atlantis.git/infrastructure/s3/s3-dev-dev.tfplan
    Amount:  $0.00 ($0.00 → $0.00)
    
    ──────────────────────────────────
    Key: ~ changed, + added, - removed
    
    2 cloud resources were detected:
    ∙ 1 was estimated, it includes usage-based costs, see https://infracost.io/usage-file
    ∙ 1 was free, rerun with --show-skipped to see details

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p s3-dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://bad1-2804-1eb0-a0-13cd-a6a0-64c4-62cd-f66a.sa.ngrok.io/lock?id=EzzioMoreira%252Fterraform-atlantis%252Finfrastructure%252Fs3%252Fdev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p s3-dev`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
